src/InformationRegisters/инкНормаВремени/инкНормаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкНормаВремени</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>РабочихДнейВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовМужчиныПятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовЖенщиныПятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовМужчиныШестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовЖенщиныШестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендраныхДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкНормаВремени/Forms/ФормаЗагрузкиСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	ЗагрузитьНачальныеДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОтоборНаФорме()
	
	Перем ЭлементОтбора;                 
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Год");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = мГод;
	
КонецПроцедуры                          

&НаСервере
Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Если НЕ ЗначениеЗаполнено(мГод) Тогда
		мГод = Год(ТекущаяДата());	
	КонецЕсли;            
	 	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНачальныеДанныеНаСервере()
	
	СоздатьОтоборНаФорме();
	
	НаборЗаписей = РегистрыСведений.инкНормаВремени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Установить(мГод);
	НаборЗаписей.Прочитать();
	
	ТекущийМесяц = Дата(Формат(мГод,"ЧГ=")+"0101000000");
	Для МесяцЧисло = 1 По 12 Цикл
		
		НайденМесяц = Ложь;
		Для каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Месяц = ТекущийМесяц Тогда
				НайденМесяц = Истина;	
				Прервать;
			КонецЕсли;
			
		КонецЦикла;      
		
		Если НайденМесяц Тогда
			Если Не ЗначениеЗаполнено(Запись.КалендраныхДней) Тогда
				Запись.КалендраныхДней = День(КонецМесяца(ТекущийМесяц));	
			КонецЕсли;
		Иначе
			Запись = НаборЗаписей.Добавить();
			Запись.Период 	= НачалоГода(ТекущийМесяц);
	        Запись.Год  	= мГод;
			Запись.Месяц 	= ТекущийМесяц;
			Запись.КалендраныхДней = День(КонецМесяца(ТекущийМесяц));
		КонецЕсли;
		
		ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц,1);	
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура мГодПриИзменении(Элемент)    
	
	ЗагрузитьНачальныеДанныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура мГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода", НачалоГода(мГод), КонецГода(мГод));
	ОписаниеОповещения     = Новый ОписаниеОповещения("ГодНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.инкВыборСтандартногоПериодаГодКвартал", ПараметрыВыбораПериода, мГод, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ГодНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мГод = НачалоГода(РезультатВыбора.НачалоПериода);  
	ЗагрузитьНачальныеДанныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзГодовогоФондаРабочегоВремени(Команда)
	
	инкУчетВремениСервер.ЗагрузитьНормуВремениИзГодовогоФондаРабочегоВремениНаСервере(мГод);
	ЗагрузитьНачальныеДанныеНаСервере();
	
КонецПроцедуры
